JESVANS/STM32F407ZGT6-Telescope-2026/Core/Src/tftlcd.c
    lcd_write_reg(0xD600, 0x00);
    lcd_write_reg(0xD601, 0x37);
    lcd_write_reg(0xD602, 0x00);
    lcd_write_reg(0xD603, 0x53);
    lcd_write_reg(0xD604, 0x00);
    lcd_write_reg(0xD605, 0x79);
    lcd_write_reg(0xD606, 0x00);
    lcd_write_reg(0xD607, 0x97);
    lcd_write_reg(0xD608, 0x00);
    lcd_write_reg(0xD609, 0xB1);
    lcd_write_reg(0xD60A, 0x00);
    lcd_write_reg(0xD60B, 0xD5);
    lcd_write_reg(0xD60C, 0x00);
    lcd_write_reg(0xD60D, 0xF4);
    lcd_write_reg(0xD60E, 0x01);
    lcd_write_reg(0xD60F, 0x23);
    lcd_write_reg(0xD610, 0x01);
    lcd_write_reg(0xD611, 0x49);
    lcd_write_reg(0xD612, 0x01);
    lcd_write_reg(0xD613, 0x87);
    lcd_write_reg(0xD614, 0x01);
    lcd_write_reg(0xD615, 0xB6);
    lcd_write_reg(0xD616, 0x02);
    lcd_write_reg(0xD617, 0x00);
    lcd_write_reg(0xD618, 0x02);
    lcd_write_reg(0xD619, 0x3B);
    lcd_write_reg(0xD61A, 0x02);
    lcd_write_reg(0xD61B, 0x3D);
    lcd_write_reg(0xD61C, 0x02);
    lcd_write_reg(0xD61D, 0x75);
    lcd_write_reg(0xD61E, 0x02);
    lcd_write_reg(0xD61F, 0xB1);
    lcd_write_reg(0xD620, 0x02);
    lcd_write_reg(0xD621, 0xD5);
    lcd_write_reg(0xD622, 0x03);
    lcd_write_reg(0xD623, 0x09);
    lcd_write_reg(0xD624, 0x03);
    lcd_write_reg(0xD625, 0x28);
    lcd_write_reg(0xD626, 0x03);
    lcd_write_reg(0xD627, 0x52);
    lcd_write_reg(0xD628, 0x03);
    lcd_write_reg(0xD629, 0x6B);
    lcd_write_reg(0xD62A, 0x03);
    lcd_write_reg(0xD62B, 0x8D);
    lcd_write_reg(0xD62C, 0x03);
    lcd_write_reg(0xD62D, 0xA2);
    lcd_write_reg(0xD62E, 0x03);
    lcd_write_reg(0xD62F, 0xBB);
    lcd_write_reg(0xD630, 0x03);
    lcd_write_reg(0xD631, 0xC1);
    lcd_write_reg(0xD632, 0x03);
    lcd_write_reg(0xD633, 0xC1);

    /***************LV2 Page 0 enable***************/
    lcd_write_reg(0xF000, 0x55);
    lcd_write_reg(0xF001, 0xAA);
    lcd_write_reg(0xF002, 0x52);
    lcd_write_reg(0xF003, 0x08);
    lcd_write_reg(0xF004, 0x00);

    /***************480x800***************/
    //lcd_write_reg(0xB500, 0x50);
    //RGB Internal mode
    //REGW 0xB30001
    //RGB I/F Setting

    lcd_write_reg(0xB000, 0x00); 
    lcd_write_reg(0xB001, 0x05); 
    lcd_write_reg(0xB002, 0x02);
    lcd_write_reg(0xB003, 0x05); 
    lcd_write_reg(0xB004, 0x02);

    /* SDT */
    lcd_write_reg(0xB600, 0x08);
    lcd_write_reg(0xB500, 0x50); /* 0x50 480x800 */

    /***************Source hold time***************/
    lcd_write_reg(0xB600, 0x05);

    /***************Gate EQ control***************/
    lcd_write_reg(0xB700, 0x00);
    lcd_write_reg(0xB701, 0x00);

    /***************Source EQ control (Mode 2)***************/
    lcd_write_reg(0xB800, 0x01);
    lcd_write_reg(0xB801, 0x05);
    lcd_write_reg(0xB802, 0x05);
    lcd_write_reg(0xB803, 0x05);
                    
    /***************Inversion mode  (2-dot)***************/
    lcd_write_reg(0xBC00, 0x02);
    lcd_write_reg(0xBC01, 0x00);
    lcd_write_reg(0xBC02, 0x00);
                     
    /*************** BOE SETTING(DEFAULT) ***************/
    lcd_write_reg(0xCC00, 0x03);
    lcd_write_reg(0xCC01, 0x00);
    lcd_write_reg(0xCC02, 0x00);

    /***************Frame rate***************/
    lcd_write_reg(0xBD00, 0x01);
    lcd_write_reg(0xBD01, 0x84);
    lcd_write_reg(0xBD02, 0x07);
    lcd_write_reg(0xBD03, 0x31);
    lcd_write_reg(0xBD04, 0x00);

    lcd_write_reg(0xBA00, 0x01);

    lcd_write_reg(0xFF00, 0xAA);
    lcd_write_reg(0xFF01, 0x55);
    lcd_write_reg(0xFF02, 0x25);
    lcd_write_reg(0xFF03, 0x01);

    /*************** Timing control 4H w/ 4-Delayms ***************/
    lcd_write_reg(0x3600, 0x40);
    lcd_write_reg(0x3500, 0x00);
    lcd_write_reg(0x3A00, 0x05);

    lcd_wr_regno(0x1100);
    osDelay(120);
    lcd_wr_regno(0x2900);
    osDelay(10);
    lcd_wr_regno(0x2C00);
}

/* LCD的画笔颜色和背景色 */
uint32_t g_point_color = 0xF800;    /* 画笔颜色 */
uint32_t g_back_color  = GRAYBLUE;    /* 背景色 */

/* 管理LCD重要参数 */
_lcd_dev lcddev;

/*------------------- 底层读写函数 -------------------*/

void lcd_wr_data(volatile uint16_t data)
{
    data = data;            /* 防止 -O2 被优化 */
    LCD->LCD_RAM = data;
}

void lcd_wr_regno(volatile uint16_t regno)
{
    regno = regno;          /* 防止 -O2 被优化 */
    LCD->LCD_REG = regno;
}

void lcd_write_reg(uint16_t regno, uint16_t data)
{
    LCD->LCD_REG = regno;
    LCD->LCD_RAM = data;
}

static void lcd_opt_delay(uint32_t i)
{
    while (i--);
}

static uint16_t lcd_rd_data(void)
{
    volatile uint16_t ram;
    lcd_opt_delay(2);
    ram = LCD->LCD_RAM;
    return ram;
}

void lcd_write_ram_prepare(void)
{
    LCD->LCD_REG = lcddev.wramcmd;
}

/*------------------- 公共功能函数（已去掉其它IC分支） -------------------*/

uint32_t lcd_read_point(uint16_t x, uint16_t y)
{
    uint16_t r = 0, g = 0, b = 0;

    if (x >= lcddev.width || y >= lcddev.height)
    {
        return 0;
    }

    lcd_set_cursor(x, y);

    /* NT35510 发送读GRAM指令 */
    lcd_wr_regno(0x2E00);

    r = lcd_rd_data();      /* dummy read */
    r = lcd_rd_data();      /* 实际颜色高字节(RG) */
    b = lcd_rd_data();      /* B */

    g = r & 0xFF;
    g <<= 8;

    return (((r >> 11) << 11) | ((g >> 10) << 5) | (b >> 11));
}

void lcd_display_on(void)
{
    lcd_wr_regno(0x2900);
}

void lcd_display_off(void)
{
    lcd_wr_regno(0x2800);
}

void lcd_set_cursor(uint16_t x, uint16_t y)
{
    /* 仅保留 NT35510 寄存器写法 */
    lcd_wr_regno(lcddev.setxcmd);
    lcd_wr_data(x >> 8);
    lcd_wr_regno(lcddev.setxcmd + 1);
    lcd_wr_data(x & 0xFF);

    lcd_wr_regno(lcddev.setycmd);
    lcd_wr_data(y >> 8);
    lcd_wr_regno(lcddev.setycmd + 1);
    lcd_wr_data(y & 0xFF);
}

/**
 * @brief       设置LCD扫描方向（只针对 NT35510）
 * @param       dir:0~7
 */
void lcd_scan_dir(uint8_t dir)
{
    uint16_t regval = 0;
    uint16_t temp;

    /* 根据扫描方式 设置 0x3600 寄存器 bit 5,6,7 位的值 */
    switch (dir)
    {
        case L2R_U2D:
            regval |= (0 << 7) | (0 << 6) | (0 << 5);
            break;
        case L2R_D2U:
            regval |= (1 << 7) | (0 << 6) | (0 << 5);
            break;
        case R2L_U2D:
            regval |= (0 << 7) | (1 << 6) | (0 << 5);
            break;
        case R2L_D2U:
            regval |= (1 << 7) | (1 << 6) | (0 << 5);
            break;
        case U2D_L2R:
            regval |= (0 << 7) | (0 << 6) | (1 << 5);
            break;
        case U2D_R2L:
            regval |= (0 << 7) | (1 << 6) | (1 << 5);
            break;
        case D2U_L2R:
            regval |= (1 << 7) | (0 << 6) | (1 << 5);
            break;
        case D2U_R2L:
            regval |= (1 << 7) | (1 << 6) | (1 << 5);
            break;
    }

