JESVANS/STM32F407ZGT6-Telescope-2026/Core/Src/tftlcd.c
        if (enshow == 0 && t < (len - 1))
        {
            if (temp == 0)
            {
                if (mode & 0x80)
                {
                    lcd_show_char(x + (size / 2) * t, y, '0', size, mode & 0x01, color);
                }
                else
                {
                    lcd_show_char(x + (size / 2) * t, y, ' ', size, mode & 0x01, color);
                }

                continue;
            }
            else
            {
                enshow = 1;
            }
        }

        lcd_show_char(x + (size / 2) * t, y, temp + '0', size, mode & 0x01, color);
    }
}

void lcd_show_string(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint8_t size, char *p, uint16_t color)
{
    uint16_t x0 = x;
    
    width += x;
    height += y;

    while ((*p <= '~') && (*p >= ' '))
    {
        if (x >= width)
        {
            x = x0;
            y += size;
        }

        if (y >= height)
        {
            break;
        }

        lcd_show_char(x, y, *p, size, 0, color);
        x += size / 2;
        p++;
    }
}

uint16_t RGB565_color(uint16_t R, uint16_t G, uint8_t B)
{
    uint16_t color = 0;

    if(R > 0x1F)    R = 0x1F;
    if(G > 0x3F)    G = 0x3F;
    if(B > 0x1F)    B = 0x1F;
    color = R << 11 | G << 5 | B;

    return color;
}

/**
 * @brief  显示 Image2LCD 生成的图片（带8字节文件头，RGB565格式）
 * @param  x      显示起始X坐标
 * @param  y      显示起始Y坐标
 * @param  image  Image2LCD 导出的数组指针（含8字节头：扫描模式、色彩模式、宽高等）
 * @note   Image2LCD 输出设置：水平扫描、16位真彩色(RGB565)、高位在前、包含图像头数据
 */
void lcd_show_image(uint16_t x, uint16_t y, const uint8_t *image)
{
    if (image == NULL) return;

    /* 解析 Image2LCD 8字节文件头 */
    uint16_t w = ((uint16_t)image[2] << 8) | image[3];  /* 宽度（大端） */
    uint16_t h = ((uint16_t)image[4] << 8) | image[5];  /* 高度（大端） */

    const uint8_t *p = image + 8;  /* 跳过8字节头，指向像素数据 */

    for (uint16_t j = 0; j < h; j++)
    {
        lcd_set_cursor(x, y + j);
        lcd_write_ram_prepare();

        for (uint16_t i = 0; i < w; i++)
        {
            /* RGB565 高字节在前 */
            uint16_t color = ((uint16_t)(*p) << 8) | (*(p + 1));
            p += 2;
            LCD->LCD_RAM = color;
        }
    }
}


